* Maximum number of unknowns
| rows | cols | max unknowns | unknown ration | tries  |
|------+------+--------------+----------------+--------|
|    3 |    4 |            7 |     0.58333333 | 213/50 |
|    4 |    5 |           12 |            0.6 | 134/50 |
|    5 |    6 |           19 |     0.56666667 | 214/50 |
|    6 |    7 |           26 |     0.61904762 | 684    |
|    7 |    8 |           34 |     0.60714286 | 211    |
|    8 |    9 |           45 |          0.625 | 450    |
|    9 |   10 |           56 |     0.62222222 | 1/50   |
#+TBLFM: $4=$3/($1*$2)
* Puzzles
** 3x4
*** Puzzle
|.|4|8|.|
|.|8|.|4|
|7|.|.|.|
*** Solution
|7|4|8|9|
|4|8|8|4|
|7|9|2|2|
** 3x4 --- 0-f
*** Puzzle
|7|.|.|5|
|.|3|8|6|
|0|4|8|.|
*** Solution
|7|5|b|5|
|b|3|8|6|
|0|4|8|4|
** 4x5
*** Puzzle
|.|3|.|.|.|
|9|.|.|4|4|
|2|.|.|8|.|
|.|3|6|.|.|
*** Solution
|3|3|3|4|2|
|9|4|9|4|4|
|2|2|2|8|1|
|2|3|6|8|1|
** 5x6
*** Puzzle
|2|.|3|1|5|.|
|.|.|1|8|.|.|
|.|7|.|3|.|.|
|.|.|.|.|5|.|
|.|.|.|.|5|8|
*** Solution
|2|5|3|1|5|8|
|7|5|1|8|6|9|
|4|7|9|3|9|4|
|7|9|6|9|5|6|
|5|9|6|9|5|8|
** 6x7
*** Puzzle
|.|.|.|2|.|6|4|
|.|6|3|.|7|.|.|
|.|1|3|.|.|.|.|
|7|.|.|.|9|5|.|
|.|8|8|3|.|.|.|
|8|.|9|.|.|.|.|
*** Solution
|8|5|7|2|3|6|4|
|2|6|3|3|7|3|4|
|3|1|3|4|2|3|5|
|7|1|6|2|9|5|5|
|8|8|8|3|1|9|5|
|8|9|9|4|8|4|7|
** 6x7 --- 0-f
*** Puzzle
|.|a|d|.|.|5|.|
|5|.|.|.|c|f|b|
|9|.|4|.|7|c|2|
|d|9|c|2|.|a|.|
|.|5|c|.|0|.|a|
|8|3|.|a|.|4|.|
*** Solution
|9|a|d|2|2|5|f|
|5|a|d|b|c|f|b|
|9|b|4|b|7|c|2|
|d|9|c|2|e|a|a|
|a|5|c|c|0|e|a|
|8|3|c|a|d|4|6|
** 6x7 --- 0-z
*** Puzzle
|3|j|q|1|.|.|2|
|6|z|.|.|y|d|y|
|m|8|8|2|u|2|.|
|.|q|k|b|m|y|4|
|y|.|r|z|t|2|h|
|.|.|a|c|d|g|j|
*** Solution
|3|j|q|1|m|b|2|
|6|z|z|b|y|d|y|
|m|8|8|2|u|2|q|
|2|q|k|b|m|y|4|
|y|h|r|z|t|2|h|
|n|x|a|c|d|g|j|
** 7x8
*** Puzzle
|.|.|.|5|7|.|.|.|
|5|9|.|.|.|.|8|.|
|9|6|3|9|.|.|.|9|
|.|.|.|3|9|.|2|.|
|.|.|.|.|.|8|.|3|
|5|.|9|.|4|.|.|.|
|1|.|9|.|.|.|9|7|
*** Solution
|2|5|3|5|7|2|6|2|
|5|9|1|9|3|3|8|2|
|9|6|3|9|6|6|8|9|
|2|6|1|3|9|7|2|2|
|4|7|9|4|2|8|3|3|
|5|8|9|4|4|1|6|3|
|1|1|9|1|4|8|9|7|
** 8x9
*** Puzzle
|.|.|7|4|8|.|.|6|2|
|2|.|2|.|.|.|.|7|.|
|.|.|8|.|.|.|2|.|3|
|1|.|.|.|4|.|.|8|.|
|.|4|1|7|.|4|.|.|.|
|9|6|9|.|.|.|.|5|2|
|.|.|.|7|.|.|3|6|.|
|.|.|.|.|.|3|.|.|.|
*** Solution
|5|1|7|4|8|1|2|6|2|
|2|5|2|9|3|4|2|7|2|
|5|3|8|6|3|1|2|5|3|
|1|1|1|4|4|9|3|8|5|
|4|4|1|7|7|4|9|1|8|
|9|6|9|1|1|1|2|5|2|
|3|1|3|7|4|1|3|6|8|
|3|3|9|2|2|3|1|2|2|
** 9x10
*** Puzzle
|1|.|.|.|1|.|3|.|2|.|
|.|.|.|2|2|.|.|.|.|.|
|9|7|.|.|.|.|.|8|6|.|
|.|.|5|.|.|9|4|.|.|6|
|3|.|.|1|.|.|.|1|9|.|
|.|.|.|8|.|.|.|6|2|.|
|7|.|.|.|7|.|.|2|.|.|
|1|3|7|.|4|.|1|6|.|6|
|.|.|1|.|.|5|.|.|4|.|
*** Solution
|1|7|2|9|1|2|3|6|2|7|
|2|7|9|2|2|9|3|6|9|1|
|9|7|4|8|3|7|7|8|6|1|
|2|2|5|5|5|9|4|9|3|6|
|3|9|9|1|5|1|6|1|9|6|
|4|7|7|8|2|2|9|6|2|3|
|7|9|1|9|7|9|9|2|8|9|
|1|3|7|9|4|1|1|6|2|6|
|7|3|1|3|7|5|3|1|4|6|
